read_verilog cpu.v alu.v regfile.v immGen.v control.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v
