read_verilog cpu.v alu.v regfile.v immgen.v control.v
synth_xilinx -top cpu
write_verilog cpu_synth.v
